# pandas

In [1]:
import pandas as pd

In [2]:
# 14-1 Series 객체의 생성

obj = pd.Series([5, -4, 7, 0, 12])
print(obj)

0     5
1    -4
2     7
3     0
4    12
dtype: int64

In [3]:
obj.values

array([ 5, -4,  7,  0, 12], dtype=int64)

In [4]:
obj.index

RangeIndex(start=0, stop=5, step=1)

In [5]:
print(obj[2])

7

In [6]:
#14-2

obj = pd.Series([8, -20, -3, 13, 2])

print(obj.values)
print(obj.index)

print(obj[2])

[  8 -20  -3  13   2]
RangeIndex(start=0, stop=5, step=1)
-3

In [7]:
#14-3

obj = pd.Series([10, 20, 30, 40, 50], index=['a','b','c','d','e'])
print(obj)

print(obj['c'])
print(obj[['d','a']])
print(obj[1:4])

a    10
b    20
c    30
d    40
e    50
dtype: int64
30
d    40
a    10
dtype: int64
b    20
c    30
d    40
dtype: int64

In [8]:
#14-4

obj = pd.Series([10, 20, 30, 40, 50])

print(obj*10)

print(obj[obj > 25])

0    100
1    200
2    300
3    400
4    500
dtype: int64
2    30
3    40
4    50
dtype: int64

In [9]:
#14-5

pop = pd.Series([9765623,3441453,2461769], index=['서울','부산','대구'])

for i, v in pop.items():
    print('%s : %d명'%(i,v))

서울 : 9765623명
부산 : 3441453명
대구 : 2461769명

In [10]:
for item in pop:
    print(item)

9765623
3441453
2461769

In [11]:
#14-6

pop = pd.Series({'서울':9765623,'부산':3441453,'대구':2461769}, index=['서울','부산','대구','광주','대전'])
print(pop)               

pop['광주'] = 149336
                 
print('광주시 인구 : %.0f명' % pop['광주'])

# NaN : 데이터가 없음

서울    9765623.0
부산    3441453.0
대구    2461769.0
광주          NaN
대전          NaN
dtype: float64
광주시 인구 : 149336명

In [12]:
pop.isna()

서울    False
부산    False
대구    False
광주    False
대전     True
dtype: bool

In [13]:
pop = pop.fillna(0)
pop

서울    9765623.0
부산    3441453.0
대구    2461769.0
광주     149336.0
대전          0.0
dtype: float64

In [14]:
pop.sum()

15818181.0

In [15]:
pop.mean()

3163636.2

In [16]:
#14-7
data ={'이름':['홍지수','안지명','김성수','최예린'],
      '아이디':['jshong','jyahn','sukim','yrchoi'],
       '비밀번호':['1234','1234','1234','1234']}
df = pd.DataFrame(data)
df

    이름     아이디  비밀번호
0  홍지수  jshong  1234
1  안지명   jyahn  1234
2  김성수   sukim  1234
3  최예린  yrchoi  1234

In [17]:
df['이름']

0    홍지수
1    안지명
2    김성수
3    최예린
Name: 이름, dtype: object

In [18]:
df['이름'][0]

'홍지수'

In [19]:
print(df)

    이름     아이디  비밀번호
0  홍지수  jshong  1234
1  안지명   jyahn  1234
2  김성수   sukim  1234
3  최예린  yrchoi  1234

In [20]:
#14-8
member = {'이름':['김영준','한지원'], '나이':[20,30], 
          '전화번호':['010-3535-4576','010-1295-7899']}

In [21]:
df = pd.DataFrame(member, columns=['이름','전화번호','나이','주소'], 
                     index=['01','02'])
df

     이름           전화번호  나이   주소
01  김영준  010-3535-4576  20  NaN
02  한지원  010-1295-7899  30  NaN

In [22]:
print(df)

     이름           전화번호  나이   주소
01  김영준  010-3535-4576  20  NaN
02  한지원  010-1295-7899  30  NaN

# Retrieval

In [23]:
#14-9
data = {'학교명':['가나고','다라고','마바고','사아고','자차고'],
        '학급수':[25,23,15,19,10], 
        '학생수':[620,600,550,580,400],
        '교사수':[80,95,70,90,65]}

df = pd.DataFrame(data,index=['10','02','03','04','05'])
df

    학교명  학급수  학생수  교사수
10  가나고   25  620   80
02  다라고   23  600   95
03  마바고   15  550   70
04  사아고   19  580   90
05  자차고   10  400   65

In [24]:
df['학생수'][2]

550

In [25]:
df['학생수']['03']

550

In [26]:
df.loc['03','학생수']

550

In [27]:
df.loc['04',['학교명','학급수','교사수']]

학교명    사아고
학급수     19
교사수     90
Name: 04, dtype: object

In [28]:
#14-10
data = {'아이디':['kim','song','han','choi'],
        '구매상품':['상품A','상품B','상품C','상품D'], 
        '가격':[15000,23000,33000,50000],
        '개수':[3,5,1,10],
        '구매일':['0303','0810','0120','0601']}

df = pd.DataFrame(data)
df

    아이디 구매상품     가격  개수   구매일
0   kim  상품A  15000   3  0303
1  song  상품B  23000   5  0810
2   han  상품C  33000   1  0120
3  choi  상품D  50000  10  0601

In [29]:
df['개수'][1], df.loc[1, '개수']

(5, 5)

In [30]:
df.iloc[1,3]

5

In [31]:
df.iloc[1,1:]

구매상품      상품B
가격      23000
개수          5
구매일      0810
Name: 1, dtype: object

In [32]:
df.iloc[1:, 0:2]

    아이디 구매상품
1  song  상품B
2   han  상품C
3  choi  상품D

# 데이터 조작

In [33]:
#14-11,12
scores = {'이름':['김지영','안지수','최성수','황예린','김소정'],
        '국어':[95,97,90,94,87], 
        '영어':[90,86,93,85,93],
        '수학':[85,88,89,88,99]}       

df = pd.DataFrame(scores)
df

    이름  국어  영어  수학
0  김지영  95  90  85
1  안지수  97  86  88
2  최성수  90  93  89
3  황예린  94  85  88
4  김소정  87  93  99

In [34]:
df2 = df.iloc[:,1:]
df2

   국어  영어  수학
0  95  90  85
1  97  86  88
2  90  93  89
3  94  85  88
4  87  93  99

In [35]:
df2.sum(axis=1)

0    270
1    271
2    272
3    267
4    279
dtype: int64

In [36]:
df['합계'] = df2.sum(axis=1)
df

    이름  국어  영어  수학   합계
0  김지영  95  90  85  270
1  안지수  97  86  88  271
2  최성수  90  93  89  272
3  황예린  94  85  88  267
4  김소정  87  93  99  279

In [37]:
df2.mean(axis=1)

0    90.000000
1    90.333333
2    90.666667
3    89.000000
4    93.000000
dtype: float64

In [38]:
df['평균'] = df2.mean(axis=1)
df

    이름  국어  영어  수학   합계         평균
0  김지영  95  90  85  270  90.000000
1  안지수  97  86  88  271  90.333333
2  최성수  90  93  89  272  90.666667
3  황예린  94  85  88  267  89.000000
4  김소정  87  93  99  279  93.000000

In [39]:
df[['이름','합계','평균']]

    이름   합계         평균
0  김지영  270  90.000000
1  안지수  271  90.333333
2  최성수  272  90.666667
3  황예린  267  89.000000
4  김소정  279  93.000000

In [40]:
df.count()

이름    5
국어    5
영어    5
수학    5
합계    5
평균    5
dtype: int64

In [41]:
len(df)

5

# - 정렬

In [42]:
df

    이름  국어  영어  수학   합계         평균
0  김지영  95  90  85  270  90.000000
1  안지수  97  86  88  271  90.333333
2  최성수  90  93  89  272  90.666667
3  황예린  94  85  88  267  89.000000
4  김소정  87  93  99  279  93.000000

In [43]:
df = df.sort_values(by=['합계'])   # 합계의 순서로 정렬 앞에 df 넣으면 df 정렬이 변경됨

In [44]:
df

    이름  국어  영어  수학   합계         평균
3  황예린  94  85  88  267  89.000000
0  김지영  95  90  85  270  90.000000
1  안지수  97  86  88  271  90.333333
2  최성수  90  93  89  272  90.666667
4  김소정  87  93  99  279  93.000000

# apply 변환

In [45]:
df = pd.DataFrame({
    'A' : [1,3,4,3,4],
    'b' : [2,3,1,2,3],
    'c' : [1,5,2,4,4],
})
df

   A  b  c
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [46]:
# 최대값 , 최소값\
# 행이나 열 단위로 더 복잡한 처리를 하고 싶을 때는 apply 메서드를 사용한다.
df.apply(lambda x: x.max() - x.min())

A    3
b    2
c    4
dtype: int64

In [47]:
# 행에 대해서 적용
df.apply(lambda x: x.max() - x.min(), axis=1)

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [48]:
# 각 열에 대해 어떤 값이 얼마나 사용되었는지 알고 싶다면 
# value_counts 함수를 넣을 수도 있다.
df.apply(pd.value_counts)

     A    b    c
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [49]:
# NAN -> 0으로 변경 fillna. 정수변경 astype
df.apply(pd.value_counts).fillna(0).astype(int)

   A  b  c
1  1  1  1
2  0  2  1
3  2  2  0
4  2  0  2
5  0  0  1

In [50]:
#14-12
scores = {'이름':['김지영','안지수','최성수','황예린','김소정'],
        '국어':[95,97,90,94,87], 
        '영어':[90,86,93,85,93],
        '수학':[85,88,89,88,99]}       

frame = pd.DataFrame(scores)
frame2 = frame.iloc[:,[1,2,3]]

In [51]:
total = frame2.sum(axis = 1)
avg = frame2.mean(axis = 1)

In [52]:
print('-'*50)
print('이름  합계 평균')
print('-'*50)
for i in range(5):
    print('%s %d %.2f'%(frame.iloc[i,0], total.iloc[i], avg.iloc[i]))
    
print('-'*50)

--------------------------------------------------
이름  합계 평균
--------------------------------------------------
김지영 270 90.00
안지수 271 90.33
최성수 272 90.67
황예린 267 89.00
김소정 279 93.00
--------------------------------------------------

### 데이터 입출력